backend/test/artillery/stress-test.yml
# Artillery HTTP Stress Test
# High-throughput HTTP stress test (3,000+ req/sec peak)
# Run: npx artillery run test/artillery/stress-test.yml

config:
  target: "http://localhost:4000"
  phases:
    # Warmup
    - name: "Warmup"
      duration: 10
      arrivalRate: 20
    # Gradual ramp
    - name: "Ramp to load"
      duration: 20
      arrivalRate: 50
      rampTo: 200
    # Sustained high load
    - name: "Sustained load"
      duration: 40
      arrivalRate: 200
    # Spike
    - name: "Spike"
      duration: 10
      arrivalRate: 400
    # Recovery
    - name: "Recovery"
      duration: 10
      arrivalRate: 100

  processor: "./functions.js"

  plugins:
    expect: {}
    metrics-by-endpoint: {}

  defaults:
    headers:
      Content-Type: "application/json"

  http:
    timeout: 30
    pool: 300

  # Stress test thresholds
  ensure:
    p99: 5000
    maxErrorRate: 15

scenarios:
  # Read-heavy operations (highest throughput)
  - name: "Read Stress"
    weight: 50
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - loop:
          - get:
              url: "/api/auctions"
              headers:
                Authorization: "Bearer {{ token }}"
              expect:
                - statusCode: 200
          - get:
              url: "/api/auctions/{{ auctionId }}"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 30

  # Bid operations stress
  - name: "Bid Stress"
    weight: 30
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 500000
          expect:
            - statusCode:
                - 200
                - 201
                - 409
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
          - think: 0.1
        count: 20

  # Mixed operations
  - name: "Mixed Stress"
    weight: 20
    flow:
      - function: "generateUsername"
      - function: "loginUser"
      - post:
          url: "/api/users/deposit"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            amount: 100000
      - get:
          url: "/api/auctions"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "auctionId"
      - loop:
          - get:
              url: "/api/auctions/{{ auctionId }}/leaderboard"
              headers:
                Authorization: "Bearer {{ token }}"
          - function: "generateBidAmount"
          - post:
              url: "/api/auctions/{{ auctionId }}/fast-bid"
              headers:
                Authorization: "Bearer {{ token }}"
              json:
                amount: "{{ bidAmount }}"
          - get:
              url: "/api/users/balance"
              headers:
                Authorization: "Bearer {{ token }}"
          - think: 0.05
        count: 15